In [1]:
# Pandas

In [2]:
# create of series
import pandas as pd
series1 = pd.Series([10,20,30])# create a series
print(series1)# dispiay the series

0    10
1    20
2    30
dtype: int64

In [3]:
#example has a numeric index in random order
series2 = pd.Series(["Kavi","Shyam","Ravi"],index=[3,5,1])
print(series2)

3     Kavi
5    Shyam
1     Ravi
dtype: object

In [4]:
#creation of series from numpy arrays
# series from a one dimensional (1D) Numpy array:

import numpy as np #import numpy with alias np
import pandas as pd
array1 = np.array([1,2,3,4])
series3 = pd.Series(array1)
print(series3)

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
# we can use letters 
series4 = pd.Series(array1, index = ["jan","Feb","Mar","Apr"])
print(series4)

jan    1
Feb    2
Mar    3
Apr    4
dtype: int64

In [6]:
#creation of series from dictionary
dict1 = {'India':'New Delhi','UK':'London','Japan':'Tokyo'}
print(dict1)

{'India': 'New Delhi', 'UK': 'London', 'Japan': 'Tokyo'}

In [7]:
series8 = pd.Series(dict1)
print(series8)

India    New Delhi
UK          London
Japan        Tokyo
dtype: object

In [8]:
seriersMnths  = pd.Series([2,3,4],index = ["Feb","Mar","Apr"])
seriersMnths["Mar"]

np.int64(3)

In [9]:
#Slicing
seriesCap = pd.Series(['New Delhi','WashingtonDC','London','Paris'], index = ['India','Usa','UK','France'])
seriesCap

India        New Delhi
Usa       WashingtonDC
UK              London
France           Paris
dtype: object

In [10]:
series1 = pd.Series([10,20,30])# create a series
series1

0    10
1    20
2    30
dtype: int64

In [11]:
seriesCap[1:3]

Usa    WashingtonDC
UK           London
dtype: object

In [12]:
import numpy as np
import pandas as pd
seriesTenTwenty=pd.Series(np.arange(10,20, 1))
print(seriesTenTwenty)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [13]:
seriesTenTwenty.head()

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [14]:
seriesTenTwenty.head(2)

0    10
1    11
dtype: int64

In [15]:
seriesTenTwenty.tail()

5    15
6    16
7    17
8    18
9    19
dtype: int64

In [16]:
seriesTenTwenty.tail(2)

8    18
9    19
dtype: int64

In [17]:
# mathematical operation on series 
seriesA = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])
seriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [18]:
seriesB = pd.Series([10,20,-10,-50,100],
index = ['z','y','a','c','e'])
seriesB

z     10
y     20
a    -10
c    -50
e    100
dtype: int64

In [19]:
seriesA+seriesB

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [20]:
seriesA-seriesB

a    11.0
b     NaN
c    53.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [21]:
seriesA*seriesB

a    -10.0
b      NaN
c   -150.0
d      NaN
e    500.0
y      NaN
z      NaN
dtype: float64

In [22]:
seriesA/seriesB

a   -0.10
b     NaN
c   -0.06
d     NaN
e    0.05
y     NaN
z     NaN
dtype: float64

In [23]:
seriesA//seriesB

a   -1.0
b    NaN
c   -1.0
d    NaN
e    0.0
y    NaN
z    NaN
dtype: float64

In [24]:
#creation of dataframe
#creation of DataFrame from numpy ndarrays
import pandas as pd
import numpy as np
array1 = np.array([10,20,30])
dFrame1 = pd.DataFrame(array1)
dFrame1

    0
0  10
1  20
2  30

In [25]:
# creation of dataframe from list of dictionary
listDict = [{'a':10,'b':20},{'a':5,'b':10,'c':20}]
dFrame = pd.DataFrame(listDict)
dFrame

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [26]:
#creation of DataFrame from series
seriesA = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])
seriesB = pd.Series([1000,2000,-1000,-5000,1000],index = ['a','b','c','d','e'])
seriesC = pd.Series([10,20,-10,-50,100],index = ['z','y','a','c','e'])

dFrame6 = pd.DataFrame(seriesA)
dFrame6

   0
a  1
b  2
c  3
d  4
e  5

In [27]:
dFrame7 = pd.DataFrame([seriesA,seriesB])
dFrame7

      a     b     c     d     e
0     1     2     3     4     5
1  1000  2000 -1000 -5000  1000

In [28]:
dFrame8 = pd.DataFrame([seriesA,seriesB,seriesC])
dFrame8

        a       b       c       d       e     z     y
0     1.0     2.0     3.0     4.0     5.0   NaN   NaN
1  1000.0  2000.0 -1000.0 -5000.0  1000.0   NaN   NaN
2   -10.0     NaN   -50.0     NaN   100.0  10.0  20.0

In [29]:
# creation of data frame from dictionary of series
import pandas as pd

ResultSheet= {'Arnab':pd.Series([90,91,97],index=['Maths','Science','Hindi']),
            'Ramit':pd.Series([92,81,96],index=['Maths','Science','Hindi']),
              'Sahir':pd.Series([89,91,88],index=['Maths','Science','Hindi']),
              'Riya':pd.Series([81,71,67],index=['Maths','Science','Hindi']),
              'Malika':pd.Series([94,95,99],index=['Maths','Science','Hindi'])}
ResultDF = pd.DataFrame(ResultSheet)
ResultDF

         Arnab  Ramit  Sahir  Riya  Malika
Maths       90     92     89    81      94
Science     91     81     91    71      95
Hindi       97     96     88    67      99

In [30]:
#adding a new column to DataFrame  
ResultDF['Jimmy']=[89,78,76]
ResultDF

         Arnab  Ramit  Sahir  Riya  Malika  Jimmy
Maths       90     92     89    81      94     89
Science     91     81     91    71      95     78
Hindi       97     96     88    67      99     76

In [31]:
#adding anew row  to a dataframe
ResultDF.loc['English']=[85,86,83,80,90,89]
ResultDF

         Arnab  Ramit  Sahir  Riya  Malika  Jimmy
Maths       90     92     89    81      94     89
Science     91     81     91    71      95     78
Hindi       97     96     88    67      99     76
English     85     86     83    80      90     89

In [32]:
#delete row with label 'Science'
ResultDF = ResultDF.drop('Science', axis=0)
ResultDF

         Arnab  Ramit  Sahir  Riya  Malika  Jimmy
Maths       90     92     89    81      94     89
Hindi       97     96     88    67      99     76
English     85     86     83    80      90     89

In [33]:
#deleting Rows or Column from a DataFrame
#Delete column having labels 'Ramit' and "Riya'
ResultDF = ResultDF.drop(['Ramit','Riya'],axis=1)
ResultDF

         Arnab  Sahir  Malika  Jimmy
Maths       90     89      94     89
Hindi       97     88      99     76
English     85     83      90     89

In [34]:
# to trename the row indices maths to sub1 english to sub3 hindi sub4 we  can write
import pandas as pd

ResultDF =  ResultDF .rename({'Maths':'sub1','English':'sub3','Hindi':'sub4'},axis='index')
print(ResultDF)

      Arnab  Sahir  Malika  Jimmy
sub1     90     89      94     89
sub4     97     88      99     76
sub3     85     83      90     89

In [35]:
# accessing DataFrame element through Indexing
#label based indexing
ResultDF.loc['sub3']

Arnab     85
Sahir     83
Malika    90
Jimmy     89
Name: sub3, dtype: int64

In [36]:
 ResultDF.loc['sub1':'sub4']

      Arnab  Sahir  Malika  Jimmy
sub1     90     89      94     89
sub4     97     88      99     76

In [37]:
import pandas as pd
import numpy as np

In [38]:
df = pd.read_csv(r"C:\Users\Ranje\Downloads\placement.csv")

In [39]:
df

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [40]:
df.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [41]:
df.tail()

    cgpa  resume_score  placed
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

In [42]:
df.shape

(100, 3)

In [43]:
df.columns

Index(['cgpa', 'resume_score', 'placed'], dtype='object')

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cgpa          100 non-null    float64
 1   resume_score  100 non-null    float64
 2   placed        100 non-null    int64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [45]:
df.describe()

           cgpa  resume_score      placed
count  100.0000    100.000000  100.000000
mean     6.9422      6.930500    0.500000
std      1.1192      0.979608    0.502519
min      5.2700      4.950000    0.000000
25%      5.9800      6.190000    0.000000
50%      6.6200      7.055000    0.500000
75%      8.0450      7.640000    1.000000
max      9.4000      9.060000    1.000000

In [46]:
td = pd.read_csv("TitanicDataset.csv")

In [47]:
td

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [48]:
td.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
td.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [50]:
td.shape

(891, 12)

In [51]:
td.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [52]:
td.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [53]:
td.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [54]:
td.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [55]:
td.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [56]:
td.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [57]:
td['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [58]:
(td['Embarked'].value_counts()).sort_values()

Embarked
Q     77
C    168
S    644
Name: count, dtype: int64

In [59]:
(td['Embarked'].value_counts()).sort_values(ascending=False)

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [60]:
td.sort_values('Embarked')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
125,126,1,3,"Nicola-Yarred, Master. Elias",male,12.0,1,0,2651,11.2417,NaN,C
354,355,0,3,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C
352,353,0,3,"Elias, Mr. Tannous",male,15.0,1,1,2695,7.2292,NaN,C
128,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69,C
...,...,...,...,...,...,...,...,...,...,...,...,...
355,356,0,3,"Vanden Steen, Mr. Leo Peter",male,28.0,0,0,345783,9.5000,NaN,S
344,345,0,2,"Fox, Mr. Stanley Hubert",male,36.0,0,0,229236,13.0000,NaN,S
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [61]:
td.sort_values('Pclass')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
...,...,...,...,...,...,...,...,...,...,...,...,...
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S

In [62]:
td['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [63]:
td.sort_values(['Pclass','Survived'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
838,839,1,3,"Chip, Mr. Chang",male,32.0,0,0,1601,56.4958,NaN,S
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,0,1,392091,9.3500,NaN,S
858,859,1,3,"Baclini, Mrs. Solomon (Latifa Qurban)",female,24.0,0,3,2666,19.2583,NaN,C
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C